const morningstar = {
    '纯债': [
        {
            "code": "003327",
            "name": "万家鑫璟纯债债券A"
        },
        {
            "code": "003328",
            "name": "万家鑫璟纯债债券C"
        },
        {
            "code": "001993",
            "name": "博时裕泰纯债债券"
        },
        {
            "code": "000187",
            "name": "华泰柏瑞丰盛纯债债券A"
        },
        {
            "code": "002929",
            "name": "博时聚盈纯债债券"
        },
        {
            "code": "002775",
            "name": "博时景兴纯债债券"
        },
        {
            "code": "003329",
            "name": "万家鑫安纯债债券A"
        },
        {
            "code": "100066",
            "name": "富国纯债债券发起 - A/B"
        },
        {
            "code": "161119",
            "name": "易方达中债新综合债券指数发起式（LOF）A"
        },
        {
            "code": "001794",
            "name": "兴银朝阳债券"
        },
        {
            "code": "003330",
            "name": "万家鑫安纯债债券C"
        },
        {
            "code": "003265",
            "name": "招商招坤纯债债券A"
        },
        {
            "code": "003102",
            "name": "长盛盛裕纯债债券A"
        },
        {
            "code": "002755",
            "name": "博时裕盛纯债债券"
        },
        {
            "code": "530021",
            "name": "建信纯债债券A"
        },
        {
            "code": "000188",
            "name": "华泰柏瑞丰盛纯债债券C"
        },
        {
            "code": "002341",
            "name": "招商招瑞纯债债券A"
        },
        {
            "code": "161120",
            "name": "易方达中债新综合债券指数发起式（LOF）C"
        },
        {
            "code": "003103",
            "name": "长盛盛裕纯债债券C"
        },
        {
            "code": "002198",
            "name": "博时裕达纯债债券"
        },
        {
            "code": "002684",
            "name": "民生加银鑫安纯债债券A"
        },
        {
            "code": "100068",
            "name": "富国纯债债券发起 - C"
        },
        {
            "code": "002520",
            "name": "招商招瑞纯债债券C"
        },
        {
            "code": "002661",
            "name": "兴业天禧债券"
        },
        {
            "code": "003207",
            "name": "博时富发纯债债券"
        },
        {
            "code": "002549",
            "name": "嘉实稳祥纯债债券A"
        },
        {
            "code": "040040",
            "name": "华安纯债债券A"
        },
        {
            "code": "531021",
            "name": "建信纯债债券C"
        },
        {
            "code": "002336",
            "name": "创金合信尊享纯债债券"
        },
        {
            "code": "002909",
            "name": "浙商惠享纯债债券"
        },
        {
            "code": "003266",
            "name": "招商招坤纯债债券C"
        },
        {
            "code": "519763",
            "name": "交银施罗德裕通纯债债券C"
        },
        {
            "code": "002169",
            "name": "永赢稳益债券"
        },
        {
            "code": "002994",
            "name": "招商招裕纯债债券A"
        },
        {
            "code": "002466",
            "name": "博时裕新纯债债券"
        },
        {
            "code": "003455",
            "name": "招商招通纯债债券C"
        },
        {
            "code": "002528",
            "name": "泰康安益纯债债券A"
        },
        {
            "code": "003155",
            "name": "中加丰尚纯债债券"
        },
        {
            "code": "003395",
            "name": "安信尊享纯债债券"
        },
        {
            "code": "003041",
            "name": "鑫元得利债券"
        },
        {
            "code": "003162",
            "name": "博时富宁纯债债券"
        },
        {
            "code": "519762",
            "name": "交银施罗德裕通纯债债券A"
        },
        {
            "code": "000152",
            "name": "大成景旭纯债债券A"
        },
        {
            "code": "003454",
            "name": "招商招通纯债债券A"
        },
        {
            "code": "003287",
            "name": "信诚稳益债券A"
        },
        {
            "code": "002140",
            "name": "博时裕诚纯债债券"
        },
        {
            "code": "003173",
            "name": "民生加银鑫安纯债债券C"
        },
        {
            "code": "002175",
            "name": "博时裕乾纯债债券A"
        },
        {
            "code": "003357",
            "name": "嘉实稳祥纯债债券C"
        },
        {
            "code": "003130",
            "name": "信诚稳利债券C"
        },
        {
            "code": "001961",
            "name": "博时裕荣纯债债券"
        },
        {
            "code": "003500",
            "name": "鑫元聚利债券"
        },
        {
            "code": "161823",
            "name": "银华永兴纯债债券（LOF）A"
        },
        {
            "code": "002698",
            "name": "博时裕利纯债债券"
        },
        {
            "code": "040041",
            "name": "华安纯债债券C"
        },
        {
            "code": "003288",
            "name": "信诚稳益债券C"
        },
        {
            "code": "003056",
            "name": "嘉实稳泽纯债债券"
        },
        {
            "code": "001578",
            "name": "博时裕瑞纯债债券"
        },
        {
            "code": "000736",
            "name": "诺安聚利债券A"
        }
    ],
    '信用债': [
        {
            "code": "003547",
            "name": "鹏华丰禄债券"
        },
        {
            "code": "002073",
            "name": "圆信永丰兴融债券A"
        },
        {
            "code": "003156",
            "name": "招商招悦纯债债券A"
        },
        {
            "code": "400030",
            "name": "东方添益债券"
        },
        {
            "code": "002074",
            "name": "圆信永丰兴融债券C"
        },
        {
            "code": "003157",
            "name": "招商招悦纯债债券C"
        },
        {
            "code": "001776",
            "name": "中欧兴利债券A"
        },
        {
            "code": "000355",
            "name": "南方丰元信用增强债券 - A"
        },
        {
            "code": "001299",
            "name": "兴业添利债券"
        },
        {
            "code": "002486",
            "name": "上银慧添利债券"
        },
        {
            "code": "002354",
            "name": "博时裕腾纯债债券"
        },
        {
            "code": "000191",
            "name": "富国信用债债券 -A/B"
        },
        {
            "code": "002811",
            "name": "博时裕顺纯债债券"
        },
        {
            "code": "003214",
            "name": "易方达富惠纯债债券"
        },
        {
            "code": "002754",
            "name": "博时裕创纯债债券"
        },
        {
            "code": "003280",
            "name": "鹏华丰恒债券"
        },
        {
            "code": "003226",
            "name": "信诚稳健债券A"
        },
        {
            "code": "003285",
            "name": "国寿安保安康纯债债券"
        },
        {
            "code": "519718",
            "name": "交银纯债债券发起 - A/B"
        },
        {
            "code": "000192",
            "name": "富国信用债债券 - C"
        },
        {
            "code": "000563",
            "name": "南方通利债券 - A"
        },
        {
            "code": "002807",
            "name": "融通通安债券"
        },
        {
            "code": "002438",
            "name": "创金合信尊盛纯债债券"
        },
        {
            "code": "000305",
            "name": "中银中高等级债券A"
        },
        {
            "code": "000032",
            "name": "易方达信用债 - A"
        },
        {
            "code": "000147",
            "name": "易方达高等级信用债债券 - A"
        },
        {
            "code": "110037",
            "name": "易方达纯债债券 - A"
        },
        {
            "code": "002650",
            "name": "东方红稳添利纯债债券A"
        },
        {
            "code": "003227",
            "name": "信诚稳健债券C"
        },
        {
            "code": "511220",
            "name": "海富通上证可质押城投债ETF"
        },
        {
            "code": "270048",
            "name": "广发纯债债券A"
        },
        {
            "code": "000186",
            "name": "华泰柏瑞季季红债券"
        },
        {
            "code": "050027",
            "name": "博时信用债纯债债券A"
        },
        {
            "code": "003259",
            "name": "博时聚利纯债债券"
        },
        {
            "code": "380005",
            "name": "中银纯债债券 - A"
        },
        {
            "code": "001911",
            "name": "博时裕恒纯债债券"
        },
        {
            "code": "000419",
            "name": "大摩优质信价纯债A"
        },
        {
            "code": "070037",
            "name": "嘉实纯债债券 - A"
        },
        {
            "code": "000033",
            "name": "易方达信用债 - C"
        },
        {
            "code": "161820",
            "name": "银华纯债信用主题债券（LOF）"
        },
        {
            "code": "000148",
            "name": "易方达高等级信用债债券 - C"
        },
        {
            "code": "003210",
            "name": "博时智臻纯债债券"
        }
    ]
};

export default morningstar;