const morningstar = {
    '纯债': [
        {
            "code": "000152",
            "name": "大成景旭纯债债券A"
        },
        {
            "code": "000187",
            "name": "华泰柏瑞丰盛纯债债券A"
        },
        {
            "code": "000188",
            "name": "华泰柏瑞丰盛纯债债券C"
        },
        {
            "code": "001794",
            "name": "兴银朝阳债券"
        },
        {
            "code": "001961",
            "name": "博时裕荣纯债债券"
        },
        {
            "code": "001993",
            "name": "博时裕泰纯债债券"
        },
        {
            "code": "002140",
            "name": "博时裕诚纯债债券"
        },
        {
            "code": "002169",
            "name": "永赢稳益债券"
        },
        {
            "code": "002175",
            "name": "博时裕乾纯债债券A"
        },
        {
            "code": "002198",
            "name": "博时裕达纯债债券"
        },
        {
            "code": "002336",
            "name": "创金合信尊享纯债债券"
        },
        {
            "code": "002341",
            "name": "招商招瑞纯债债券A"
        },
        {
            "code": "002466",
            "name": "博时裕新纯债债券"
        },
        {
            "code": "002520",
            "name": "招商招瑞纯债债券C"
        },
        {
            "code": "002528",
            "name": "泰康安益纯债债券A"
        },
        {
            "code": "002549",
            "name": "嘉实稳祥纯债债券A"
        },
        {
            "code": "002661",
            "name": "兴业天禧债券"
        },
        {
            "code": "002684",
            "name": "民生加银鑫安纯债债券A"
        },
        {
            "code": "002755",
            "name": "博时裕盛纯债债券"
        },
        {
            "code": "002775",
            "name": "博时景兴纯债债券"
        },
        {
            "code": "002825",
            "name": "融通通和债券"
        },
        {
            "code": "002909",
            "name": "浙商惠享纯债债券"
        },
        {
            "code": "002929",
            "name": "博时聚盈纯债债券"
        },
        {
            "code": "002970",
            "name": "博时裕昂纯债债券"
        },
        {
            "code": "002991",
            "name": "嘉实稳鑫纯债债券"
        },
        {
            "code": "002994",
            "name": "招商招裕纯债债券A"
        },
        {
            "code": "003041",
            "name": "鑫元得利债券"
        },
        {
            "code": "003102",
            "name": "长盛盛裕纯债债券A"
        },
        {
            "code": "003103",
            "name": "长盛盛裕纯债债券C"
        },
        {
            "code": "003121",
            "name": "信诚稳利债券A"
        },
        {
            "code": "003130",
            "name": "信诚稳利债券C"
        },
        {
            "code": "003155",
            "name": "中加丰尚纯债债券"
        },
        {
            "code": "003162",
            "name": "博时富宁纯债债券"
        },
        {
            "code": "003173",
            "name": "民生加银鑫安纯债债券C"
        },
        {
            "code": "003207",
            "name": "博时富发纯债债券"
        },
        {
            "code": "003258",
            "name": "博时富祥纯债债券A"
        },
        {
            "code": "003265",
            "name": "招商招坤纯债债券A"
        },
        {
            "code": "003266",
            "name": "招商招坤纯债债券C"
        },
        {
            "code": "003287",
            "name": "信诚稳益债券A"
        },
        {
            "code": "003288",
            "name": "信诚稳益债券C"
        },
        {
            "code": "003327",
            "name": "万家鑫璟纯债债券A"
        },
        {
            "code": "003328",
            "name": "万家鑫璟纯债债券C"
        },
        {
            "code": "003329",
            "name": "万家鑫安纯债债券A"
        },
        {
            "code": "003330",
            "name": "万家鑫安纯债债券C"
        },
        {
            "code": "003395",
            "name": "安信尊享纯债债券"
        },
        {
            "code": "003424",
            "name": "江信洪福纯债债券"
        },
        {
            "code": "003438",
            "name": "招商招怡纯债债券A"
        },
        {
            "code": "003445",
            "name": "中加丰享纯债债券"
        },
        {
            "code": "003448",
            "name": "招商招华纯债债券A"
        },
        {
            "code": "003454",
            "name": "招商招通纯债债券A"
        },
        {
            "code": "003455",
            "name": "招商招通纯债债券C"
        },
        {
            "code": "003487",
            "name": "平安惠融纯债债券"
        },
        {
            "code": "003499",
            "name": "新疆前海联合添和纯债债券C"
        },
        {
            "code": "003500",
            "name": "鑫元聚利债券"
        },
        {
            "code": "003549",
            "name": "浙商惠裕纯债债券"
        },
        {
            "code": "003566",
            "name": "博时臻选纯债债券A"
        },
        {
            "code": "003568",
            "name": "平安惠利纯债债券"
        },
        {
            "code": "003614",
            "name": "信诚景瑞债券A"
        },
        {
            "code": "003615",
            "name": "信诚景瑞债券C"
        },
        {
            "code": "003672",
            "name": "兴业裕华债券"
        },
        {
            "code": "003673",
            "name": "中加丰裕纯债债券"
        },
        {
            "code": "003681",
            "name": "建信睿享纯债债券"
        },
        {
            "code": "003708",
            "name": "博时民丰纯债债券A"
        },
        {
            "code": "003730",
            "name": "博时富华纯债债券"
        },
        {
            "code": "003742",
            "name": "汇安嘉汇纯债债券A"
        },
        {
            "code": "003767",
            "name": "泰达宏利纯利债券A"
        },
        {
            "code": "003847",
            "name": "华安鼎丰债券"
        },
        {
            "code": "003891",
            "name": "汇安嘉裕纯债债券"
        },
        {
            "code": "003929",
            "name": "中银证券安进债券A"
        },
        {
            "code": "003930",
            "name": "中银证券安进债券C"
        },
        {
            "code": "040040",
            "name": "华安纯债债券A"
        },
        {
            "code": "040041",
            "name": "华安纯债债券C"
        },
        {
            "code": "100066",
            "name": "富国纯债债券发起 - A/B"
        },
        {
            "code": "100068",
            "name": "富国纯债债券发起 - C"
        },
        {
            "code": "161119",
            "name": "易方达中债新综合债券指数发起式（LOF）A"
        },
        {
            "code": "161120",
            "name": "易方达中债新综合债券指数发起式（LOF）C"
        },
        {
            "code": "202108",
            "name": "南方润元纯债债券 - A/B"
        },
        {
            "code": "519332",
            "name": "浦银安盛盛达纯债债券A"
        },
        {
            "code": "519762",
            "name": "交银施罗德裕通纯债债券A"
        },
        {
            "code": "519763",
            "name": "交银施罗德裕通纯债债券C"
        },
        {
            "code": "519985",
            "name": "长信纯债壹号债券A"
        },
        {
            "code": "530021",
            "name": "建信纯债债券A"
        },
        {
            "code": "531021",
            "name": "建信纯债债券C"
        }
    ],
    '信用债': [
        {
            "code": "000015",
            "name": "华夏纯债债券A"
        },
        {
            "code": "000032",
            "name": "易方达信用债 - A"
        },
        {
            "code": "000033",
            "name": "易方达信用债 - C"
        },
        {
            "code": "000147",
            "name": "易方达高等级信用债债券 - A"
        },
        {
            "code": "000186",
            "name": "华泰柏瑞季季红债券"
        },
        {
            "code": "000191",
            "name": "富国信用债债券 -A/B"
        },
        {
            "code": "000192",
            "name": "富国信用债债券 - C"
        },
        {
            "code": "000194",
            "name": "银华信用四季红债券A"
        },
        {
            "code": "000205",
            "name": "易方达投资级信用债债券 - A"
        },
        {
            "code": "000206",
            "name": "易方达投资级信用债债券 - C"
        },
        {
            "code": "000305",
            "name": "中银中高等级债券A"
        },
        {
            "code": "000355",
            "name": "南方丰元信用增强债券 - A"
        },
        {
            "code": "000356",
            "name": "南方丰元信用增强债券 - C"
        },
        {
            "code": "000419",
            "name": "大摩优质信价纯债A"
        },
        {
            "code": "000563",
            "name": "南方通利债券 - A"
        },
        {
            "code": "000914",
            "name": "中加纯债债券"
        },
        {
            "code": "000943",
            "name": "工银中高等级信用债债券A"
        },
        {
            "code": "001299",
            "name": "兴业添利债券"
        },
        {
            "code": "001776",
            "name": "中欧兴利债券A"
        },
        {
            "code": "001911",
            "name": "博时裕恒纯债债券"
        },
        {
            "code": "002073",
            "name": "圆信永丰兴融债券A"
        },
        {
            "code": "002074",
            "name": "圆信永丰兴融债券C"
        },
        {
            "code": "002354",
            "name": "博时裕腾纯债债券"
        },
        {
            "code": "002438",
            "name": "创金合信尊盛纯债债券"
        },
        {
            "code": "002486",
            "name": "上银慧添利债券"
        },
        {
            "code": "002550",
            "name": "嘉实稳荣债券"
        },
        {
            "code": "002650",
            "name": "东方红稳添利纯债债券A"
        },
        {
            "code": "002754",
            "name": "博时裕创纯债债券"
        },
        {
            "code": "002807",
            "name": "融通通安债券"
        },
        {
            "code": "002811",
            "name": "博时裕顺纯债债券"
        },
        {
            "code": "003078",
            "name": "泰康安惠纯债债券 A"
        },
        {
            "code": "003156",
            "name": "招商招悦纯债债券A"
        },
        {
            "code": "003157",
            "name": "招商招悦纯债债券C"
        },
        {
            "code": "003210",
            "name": "博时智臻纯债债券"
        },
        {
            "code": "003214",
            "name": "易方达富惠纯债债券"
        },
        {
            "code": "003226",
            "name": "信诚稳健债券A"
        },
        {
            "code": "003227",
            "name": "信诚稳健债券C"
        },
        {
            "code": "003259",
            "name": "博时聚利纯债债券"
        },
        {
            "code": "003280",
            "name": "鹏华丰恒债券"
        },
        {
            "code": "003285",
            "name": "国寿安保安康纯债债券"
        },
        {
            "code": "003417",
            "name": "中加丰泽纯债债券"
        },
        {
            "code": "003547",
            "name": "鹏华丰禄债券"
        },
        {
            "code": "003569",
            "name": "招商招丰纯债债券A"
        },
        {
            "code": "003618",
            "name": "招商招旺纯债债券A"
        },
        {
            "code": "003619",
            "name": "招商招旺纯债债券C"
        },
        {
            "code": "003648",
            "name": "融通通祺债券"
        },
        {
            "code": "003809",
            "name": "招商招顺纯债债券A"
        },
        {
            "code": "003819",
            "name": "广发景华纯债债券"
        },
        {
            "code": "003824",
            "name": "天弘信利债券A"
        },
        {
            "code": "003949",
            "name": "兴全稳泰债券A"
        },
        {
            "code": "003983",
            "name": "鹏华丰惠债券"
        },
        {
            "code": "004059",
            "name": "鑫元招利债券"
        },
        {
            "code": "050027",
            "name": "博时信用债纯债债券A"
        },
        {
            "code": "070037",
            "name": "嘉实纯债债券 - A"
        },
        {
            "code": "110037",
            "name": "易方达纯债债券 - A"
        },
        {
            "code": "110038",
            "name": "易方达纯债债券 - C"
        },
        {
            "code": "161820",
            "name": "银华纯债信用主题债券（LOF）"
        },
        {
            "code": "270048",
            "name": "广发纯债债券A"
        },
        {
            "code": "380005",
            "name": "中银纯债债券 - A"
        },
        {
            "code": "400030",
            "name": "东方添益债券"
        },
        {
            "code": "511220",
            "name": "海富通上证可质押城投债ETF"
        },
        {
            "code": "519718",
            "name": "交银纯债债券发起 - A/B"
        },
        {
            "code": "519720",
            "name": "交银纯债债券发起 - C"
        },
        {
            "code": "519782",
            "name": "交银施罗德裕隆纯债债券A"
        },
        {
            "code": "519783",
            "name": "交银施罗德裕隆纯债债券C"
        }
    ]
};

export default morningstar;